app/views/recipes/new.html.erb


   <%= f.select :category_ids, Category.all.collect{|c| [c.title]}.uniq, :prompt => 'Select One' %>
---
SELECT  "categories".* FROM "categories"  ORDER BY "categories"."id" ASC LIMIT 1