app/views/recipes/show.html.erb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 1]]
---
<div class="ingredients">
  <% @recipe.ingredients.each do |ingredient| %>