app/views/users/show.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]
---
<ul>
  <% @user.recipes.each do |recipe| %>