app/controllers/recipes_controller.rb

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def show
    @recipe = Recipe.find(params[:id])
    @user = User.find(@recipe.user_id)

INSERT INTO "recipes" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["description", "this is a test"], ["user_id", 1], ["created_at", "2016-05-17 18:42:14.773837"], ["updated_at", "2016-05-17 18:42:14.773837"]]
INSERT INTO "ingredients" ("title", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "taco"], ["recipe_id", 1], ["created_at", "2016-05-17 18:42:14.776716"], ["updated_at", "2016-05-17 18:42:14.776716"]]
---
  def create
    @recipe = Recipe.create(recipe_params)
    @recipe.user_id = current_user.id
    ingredient = Ingredient.create(params[:ingredients])

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 2]]
---
  def destroy
    @recipe = Recipe.find(params[:id])
    authorize @recipe
    @recipe.destroy